Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: Implementation errors in the server could cause clients to authorize keys for access they were not intended to have, or to apply fewer restrictions than were intended.
ja: サーバの実装エラーにより, クライアントが意図していないアクセスに対して鍵を認証に利用したり, 意図したものよりも少ない制限を適用する可能性がある.

source: The Secure Shell (SSH) Public Key File Format
ja: セキュアシェル (SSH) 公開鍵ファイル形式

source: It runs over the user authentication protocol.
ja: このプロトコルは, ユーザ認証プロトコル上で動作する.

source: If the username does not comply to the NETCONF requirements on usernames [RFC6241], i.e., the username is not representable in XML, the SSH session MUST be dropped.
ja: このユーザ名が, NETCONF のユーザ名に対する要件 [RFC6241] を満していない, つまり ユーザ名が XML で表現できない場合は, SSH のセッションは中止されなければならない.

source: The document defines a new DNS resource record that contains a standard SSH key fingerprint.
ja: この文書は, 標準SSH鍵指紋を含む新しい DNS リソースレコードを定義する.

source: For example, curves over finite fields GF(2^m), where m is composite, may be susceptible to an attack based on the Weil descent.
ja: たとえば, 有限体 GR(2^m) 上の曲線(mは合成数)は, Weil descent に基づく攻撃に対して弱いかもしれない.

source: snmpSshtmSessionNoSubsystems OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "The number of times an openSession() request failed to open a session as an SSH client due to inability to connect to the requested subsystem.
ja: snmpSshtmSessionNoSubsystems OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "要求されたサブシステムへの接続が不能なため SSH クライアントとしてセッションの開始に失敗した openSession() 要求の回数.

source: Note that this is not sent after each step in a multi-method authentication sequence, but only when the authentication is complete.
ja: 複数の方法で認証を行なう場合のそれぞれのステップで送られるのではなく, 認証が完了した場合にのみ送られることに注意.

source: If the most significant bit would be set for a positive number, the number MUST be preceded by a zero byte.
ja: 正の数に対して最上位ビットを設定したいならば, 0 のバイトを先行させなければならない.

source: It assumed that this runs over a secure transport layer protocol, which has already authenticated the server machine, established an encrypted communications channel, and computed a unique session identifier for this session.
ja: このプロトコルでは, すでにサーバマシンを認証し暗号化されたコミュニケーションチャンネルを確立しセンションのユニークな識別子を計算した, 安全なトランスポート層プロトコルの上で動くことを仮定した.

source: TCP/IP Port Forwarding
ja: TCP/IP ポート転送

source: If the server's final call to GSS_Accept_sec_context() (resulting in a major_status code of GSS_S_COMPLETE) returns a zero-length token or no token at all, it sends the following:
ja: サーバの最後の (major_status コードが GSS_S_COMPLETE となった) GSS_Accept_sec_context() 呼び出しが クライアントに送るための長さ0のトークンを返したりトークンを返さなかったら, サーバは以下を送る:

source: Public Key Authentication ..........................23 9.4.5.
ja: 公開鍵認証 ..........................23 9.4.5.

source: In this case, the key exchange MUST fail.
ja: この場合, 鍵交換は失敗しなければならない.

source: Applicability Statement .........................................3 4.
ja: 適用性についての意見 .........................................3 4.

source: Names are case-sensitive, and MUST NOT be longer than 64 characters.
ja: 名前は大文字小文字が区別され, 64文字以下でなければならない.

source: Man-in-the-middle
ja: 中間者

source: Currently, SSH performs the initial key exchange using the "diffie-hellman-group1-sha1" method [RFC4253].
ja: 現在, SSHは "diffie-hellman-group1-sha1" 法 [RFC4253] を用いて最初の鍵交換をしている.

source: Opening the Public Key Subsystem .
ja: 公開鍵サブシステムの開始 .

source: End point security is assumed by the connection protocol.
ja: コネクションプロトコルは, エンドポイントのセキュリティを前提とする.

source: Future Assignments of Names .
ja: 将来の名前の割り当て .

source: Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED.
ja: さらに, SNMPv3 より前の SNMP バージョンの配置は推奨されない.

source: The value for rsa_signature_blob is encoded as a string containing s (which is an integer, without lengths or padding, unsigned, and in network byte order).
ja: rsa_signature_blob の値は,(長さやパディングがない符号無しのネットワークバイトオーダーの160-bitの整数である) s を含む文字列としてエンコードされる.

source: The client must also send an XML document containing a <hello> element to indicate the client's capabilities to the server.
ja: クライアントも サーバにクライアントの機能を示すために <hello> 要素を含む XML 文書を送らなければならない.

source: When encryption is in effect, the packet length, padding length, payload, and padding fields of each packet MUST be encrypted with the given algorithm.
ja: 暗号化が行なわれている場合, パケットの packet length, padding length, payload, padding のフィールドは, 取り決められた暗号アリゴリズムによって暗号化されなければならない.

source: The server could require both password and public key authentication; however, this requires the client to expose its password to the server (see the section on Password Authentication below.)
ja: サーバは, パスワード認証と公開鍵認証を同時に要求できる. しかし, このときクライアントはパスワードをサーバにさらす必要がある(次のパスワード認証の節を参照)

source: The SSHFP RDATA Format
ja: SSHFP RDATA フォーマット

source: Even if they are not, the signing operation involves some expensive computation.
ja: もしそれがなくても, 署名の計算は多くの演算能力を必要とする.

source: At the time of this writing, commonly used ciphers include 3DES, ARCFOUR, twofish, serpent, and blowfish.
ja: 執筆時点では, 広く利用されている暗号には, 3DES, ARCFOUR, twofish, serpent, blowfish がある.

source: The SSH protocol also uses public/private key pairs to authenticate the server.
ja: SSH プロトコルは, サーバの認証でも公開鍵/秘密鍵ペアを利用する.

source: Debug Messages .....................................22 9.4.3.
ja: デバッグメッセージ ..................................22 9.4.3.

source: o Transport layer generic messages (1 to 19) (but SSH_MSG_SERVICE_REQUEST and SSH_MSG_SERVICE_ACCEPT MUST NOT be sent);
ja: o トランスポート層の一般メッセージ (1 to 19) (しかし, SSH_MSG_SERVICE_REQUEST と SSH_MSG_SERVICE_ACCEPT は 送ってはならない);

source: A SSH_MSG_USERAUTH_FAILURE message MUST NOT be sent for an aborted method.
ja: 中止された認証法については, SSH_MSG_USERAUTH_FAILURE メッセージを送ってはならない.

source: Connection Protocol
ja: コネクション プロトコル

source: With this extra level of protection, a "man-in-the-middle" attacker who has convinced a client of his authenticity cannot then relay user authentication messages between the real client and server, thus gaining access to the real server.
ja: この追加のレベルの保護で、 クライアントにその信頼性を確信させた"中間者攻撃"の攻撃者が、 本物のクライアントとサーバの間でユーザ認証メッセージを中継して本物のサーバのアクセス権限を得ようとすることができなくなる.

source: This Transport Model is designed to meet the security and operational needs of network administrators, maximize usability in operational environments to achieve high deployment success, and at the same time minimize implementation and deployment costs to minimize deployment time.
ja: このトランスポートモデルは, ネットワークの管理者のセキュリティと運用上のニーズを満たし, 配置の成功を達成する運用環境の使い勝手を最大化し, 同時に 配置時間を最小にするため実装と配置のコストを最小限にするよう設計された.

source: Localization and Character Set Support
ja: 地域化と文字セットのサポート

source: string K_S // a string encoding an X.509v3 certificate // containing the server's ECDSA public host key
ja: string K_S // サーバの ECDSA 公開ホスト鍵を含む X.509v3 証明書をエンコードした文字列

source: Essentially, the forwarding of these protocols may violate site- specific security policies, as they may be undetectably tunneled through a firewall.
ja: 本質的に, これらのプロトコルの転送は, ファイアウォールを検知されずにトンネルしてしまうので, サイト特有のセキュリティポリシーを破ることになるだろう.

source: The part of the identification string preceding the Carriage Return and Line Feed is used in the Diffie-Hellman key exchange (see Section 8).
ja: キャリッジリターンとラインフィードの前の文字列の部分は, Diffie-Hellman 鍵交換に使われる(8 節を参照).

source: The following values are assigned:
ja: 次の値が割り当てられている.

source: This discussion is formalized with proofs of security in [BKN1,BKN2].
ja: この議論は, [BKN1,BKN2}のセキュリティの照明で定式化されている.

source: All implementations MUST understand this message, but they are allowed to ignore it.
ja: すべての実装はこのメッセージを理解しなければならない. しかし無視してもよい.

source: These include public key, password, and host-based mechanisms.
ja: これらに 公開鍵, パスワード, ホストベースメカニズムが含まれている.

source: However, channel requests for distinct channels MAY be replied to out-of-order.
ja: しかし, 別のチャンネルに対する要求には, 順番が入れ変って返答されてもよい.

source: However, the procedures allow for new authentication and privacy methods to be specified at a future time if the need arises.
ja: しかし, 必要が生じたら, この手順は将来指定される新しい認証とプライバシーの方法を許可する.

source: Public Key File Body .......................................4 3.5.
ja: 公開鍵ファイルの本体 .......................................4 3.5.

source: Key Re-Exchange ................................................23 10.
ja: 鍵の再交換.............................................23 10.

source: A set of elliptic curve domain parameters defines a group of order n generated by a base point P.
ja: 楕円曲線ドメインパラメータの集合は, ベースポイント(基底点) P から生成される オーダ(位数)の群 n で定義される.

source: After receiving the SSH_MSG_KEXINIT packet from the other side, each party will know whether their guess was right.
ja: 相手側から SSH_MSG_KEXINIT パケットを受け取った後で, それぞれの側は推測が正しいか知る.

source: Completion
ja: 完了

source: If unsuccessful, the transport connection is closed, the snmpSshtmSessionNoSubsystems counter is incremented, an error indication is returned to the calling module, and processing stops for this message.
ja: ユーザ認証が失敗したら, トランスポート接続は閉じられ, snmpSshtmSessionNoSubsystems カウンタがインクリメントされ, エラー表示が呼び出し元モジュールに返されて, このメッセージに対する処理が停止する.

source: GSS-API Authentication Overview ...........................13 3.2.
ja: GSS-API 認証の概要 ...........................13 3.2.

source: The SnmpSSHAddress Textual Convention echos this common SSH notation.
ja: SnmpSSHAddress テキスト表記法は, この共通のSSH 表記法を利用する.

source: The instruction field SHOULD NOT be truncated.
ja: instruction フィールドは, 切り詰めないほうがよい.

source: Context may impose additional restrictions on the names.
ja: 前後関係が, name に対するさらなる制約を課すかもしれない.

source: Encryption Modes
ja: 暗号モード

source: o The family of SSH public key algorithm names beginning with "x509v3-ecdsa-sha2-" and not containing the at-sign ('@').
ja: o "x509v3-ecdsa-sha2-" で始まり アットマーク ('@') を含まない SSH 公開鍵アルゴリズム名ファミリ.

source: The client sends a service request once a secure, transport-layer connection has been established.
ja: 安全なトランスポート層の接続が確立した時点で, クライアントはサービスの要求を送る.

source: The REQUIRED curves in this document are 256-, 384-, and 521-bit curves; implementations SHOULD NOT use curves smaller than 160 bits.
ja: この文書の必須の曲線は, 256や384, 512 ビットの曲線だ. 実装は160ビットよりも小さい曲線を使わないほうがよい.

source: "subsystem" specifies a comma-separated list of subsystems that may be started (using a "subsystem" request) when this key is in use.
ja: "subsystem" は, この鍵を利用する場合に ("subsystem" 要求を用いて) 開始できる サブシステムのカンマ区切りリストを指定する.

source: If no SSH_MSG_KEXGSS_HOSTKEY message has been sent by the server or received by the client, then the empty string is used in place of K_S when computing the exchange hash.
ja: SSH_MSG_KEXGSS_HOSTKEY メッセージがサーバから送られたりクライアントで受け取られたりしていなければ, 交換ハッシュの計算で K_S には空文字列を利用する.

source: However, if the guess was wrong, and a packet was optimistically sent by one or both parties, such packets MUST be ignored (even if the error in the guess would not affect the contents of the initial packet(s)), and the appropriate side MUST send the correct initial packet.
ja: しかし, 推測が間違っていて, かつパケットが一方ないし両方の側から楽観的に送られたなら, それらのパケットが無視されなければならない (たとえ推測のエラーが最初のパケットの内容に影響しなくても). また, 適切な側が正しい初期パケットを送らなければならない.

source: In order to allow NETCONF traffic to be easily identified and filtered by firewalls and other network devices, NETCONF servers MUST default to providing access to the "netconf" SSH subsystem only when the SSH session is established using the IANA-assigned TCP port 830.
ja: NETCONF のトラフィックを容易に識別しファイアウォールや他のネットワークデバイスでフィルタするために, NETCONF サーバは, IANA に割り当てられた TCP ポート 830 を用いて SSH のセッションが確立された場合のみ "netconf" SSH サブシステムへのアクセスを提供するのをデフォルトとしなければならない.

source: Because of this, extra care should be taken to ensure that SSH access to BREAK-enabled ports are limited to users with appropriate privileges to execute such functions.
ja: このため, BREAKが有効なポートへのSSHのアクセスがこれらの機能を実行するための適切な権限を持つユーザに限定されていることを, 非常に注意する必要がある.

source: This is especially important if SSHFP is to be used as a basis for host key rollover and/or revocation, as described above.
ja: 上で述べたように ホスト鍵の変更や廃止の基盤として SSHFPが使われる場合に, これは非常に重要だ.

source: If the session stays active long enough, however, this sequence number will wrap.
ja: しかし, セッションが十分に長く有効だと, このシーケンス番号が繰替えしてしまう.

source: ECMQV Key Exchange and Verification Method Name (ecmqv-sha2) ..............................................12 7.
ja: ECMQV 鍵交換/検証法の名前 (ecmqv-sha2) ..............................................12 7.

source: It is permissible to change some or all of the algorithms during the re-exchange.
ja: 鍵の再交換でいくつかないしすべてのアルゴリズムを変更することが許されている.

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in RFC 2119 [RFC2119].
ja: この文書でのキーワード "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", "OPTIONAL" は, RFC 2119 [RFC2119] で記述されているように解釈される.

source: The object identifiers of the two key purpose IDs defined in this document are as follows:
ja: この文書で定義される 2つの鍵目的 ID のオブジェクト識別子は以下の通りだ:

source: So, if this MIB module is implemented correctly, then there is no risk that an intruder can alter or create any management objects of this MIB module via direct SNMP SET operations.
ja: つまり, この MIB モジュールが正しく実装されたら, 直接の SNMP SET 操作によってこの MIB モジュールの管理オブジェクトを侵入者が変更したり作成するリスクはない.

source: payload The useful contents of the packet.
ja: payload パケットの有用な中身.

source: If the server supports the service (and permits the client to use it), it MUST respond with the following:
ja: サーバがサービスをサポートし(クライアントによる利用を許可するなら), 次のメッセージを返答しなければならない:

source: The following method-specific message numbers are used by the "publickey" authentication method.
ja: "publickey" 認証法では, 次の認証法特有のメッセージ番号が使われる.

source: On slow CPUs, this key exchange can take tens of seconds to complete, which can be irritating for the user.
ja: 遅いCPUでは, この鍵交換は計算に数十秒かかることがあり, ユーザをいらいらさせてしまうだろう.

source: By contrast, when GSS-API-based key exchange is used, host keys sent via the SSH_MSG_KEXGSS_HOSTKEY message are authenticated as part of the GSS-API key exchange, even when previously unknown to the client.
ja: 対照的に, GSS-API ベースの鍵交換が利用される場合は, SSH_MSG_KEXGSS_HOSTKEY メッセージで送られるホスト鍵は, クライアントが事前に知らない場合でも, GSS-API 鍵交換の一部として認証される.

source: The family of key exchange method names defined for use with this key exchange can be found in Section 6.3.
ja: この鍵交換の利用のために定義された名前のファミリーは 6.3 節にある.

source: In stateful-decryption counter mode, both the sender and the receiver maintain an internal L-bit counter X. The initial value of X should be the initial IV (as computed in Section 7.2 of [RFC4253]) interpreted as an L-bit unsigned integer in network-byte-order.
ja: stateful-decryption counter モードでは, 送信側と受信側の両方が内部のL-bitなカウンタ X を保持する. Xの初期値は([RFC4253]の7.2節で計算される) 初期IV である必要がある. 初期IVは L-bitのネットワークバイトオーダー符号無し整数として解釈される.

source: The client MAY ignore this message.
ja: クライアントは, このメッセージを無視してもよい.

source: The method name for each method is the concatenation of the string "gss-group1-sha1-" with the Base64 encoding of the MD5 hash [MD5] of the ASN.1 Distinguished Encoding Rules (DER) encoding [ASN1] of the underlying GSS-API mechanism's Object Identifier (OID).
ja: 各方法の方法名は， 文字列 "gss-group1-sha1-" と， 基底のGSS-API メカニズムオブジェクト識別子 (OID) の ASN.1Distinguished Encoding Rules (DER) エンコーディング [ASN1] の MD5 ハッシュの Base64 エンコーディングの連結

source: The output of shared key generation is a field element xp.
ja: 共有鍵の生成の出力は, フィールド要素 xp だ.

source: If the client receives this message when no call to GSS_Init_sec_context() has yet resulted in a major_status code of GSS_S_COMPLETE, a protocol error has occurred and the key exchange MUST fail.
ja: GSS_Init_sec_context() の呼び出しで major_status コードが GSS_S_COMPLETE になっていないのにこのメッセージをクライアントが受けとったならば, プロトコルエラーが起きており鍵交換は失敗しなければならない.

source: A consequence of this is that encrypting the same data (for instance, a password) sufficiently many times in separate Arcfour keystreams can be sufficient to leak information about it to an adversary.
ja: この結果として, (例えばパスワードなどの)同じデータの暗号化を異なる Arcfourの鍵ストリームで何度も行なうと, 攻撃者に情報を漏らす可能性がある.

source: To make it possible for the originator of a request to identify to which request each reply refers, it is REQUIRED that replies to SSH_MSG_GLOBAL_REQUESTS MUST be sent in the same order as the corresponding request messages.
ja: 要求を開始した側がどの要求を参照してるかを識別するのを可能にするために,SSH_MSG_GLOBAL_REQUESTS の返答は, 関連する要求のメッセージと同じ順番で送られなければならないことが要求されている.

source: The window MUST NOT be increased above 2^32 - 1 bytes.
ja: 2＾32 - 1 byte を越えて window が拡大されることはない.

source: To increase the speed of the key exchange, both client and server may reduce the size of their private exponents.
ja: 鍵交換のスピードを増すため, クライアントとサーバがそれぞれのプライベート指数のサイズを減らすことができる.

source: HASH hash algorithm for calculating exchange hash, etc. HLEN output length of HASH in bits MINKLEN minimum transient RSA modulus length in bits
ja: HASH 交換ハッシュなどを計算するハッシュアルゴリズム. HLEN ビットでのハッシュの出力の長さ MINKLEN ビットでの一時RSAモジュラスの長さの最小値

source: Note that the session id can be made public without harming the security of the protocol.
ja: セッション識別子は, プロトコルのセキュリティを損なうことなく公開できることに注意.

source: A name-list is represented as a uint32 containing its length (number of bytes that follow) followed by a comma-separated list of zero or more names.
ja: name-list は, 長さをbyte数で指定するuint32と それに続く0 ないしいくつかの name のカンマ区切りリストで表現される.

source: With that, they may be able to alter the contents of a packet in transit.
ja: このとき, 攻撃者は通信中のパケットの内容を変更できる.

source: If the 'message' string is displayed, control character filtering, discussed in [SSH-ARCH], SHOULD be used to avoid attacks by sending terminal control characters.
ja: 'message' 文字列を表示するなら, [SSH-ARCH]での議論のように, 端末の制御文字を利用した攻撃を避けるために制御文字のフィルタを用いる必要がある.

source: If ECMQV key exchange is chosen, then the public key algorithm supporting ECC host keys MUST also be chosen.
ja: ECMQV 鍵交換が選ばれる場合は, ECC ホスト鍵をサポートする公開鍵アルゴリズムが選ばれなければならない.

source: Details of these protocols are described in separate documents.
ja: これらのプロトコルの詳細は別々の文書に記述されている.

source: The following message numbers have been defined in this document:
ja: 以下のメッセージ番号を, この文書で定義する.

source: If the value is empty, no subsystems may be started.
ja: この値が空なら, どんなサブシステムも開始できない.

source: Notification Authorization Considerations
ja: 通知の認可の考察

source: IV and Counter Management ..................................7 7.2.
ja: IV とカウンタの管理 ..................................7 7.2.

source: If the user name is not empty, and the requested user does not exist, the server MAY disconnect or MAY send a bogus list of acceptable authentications but never accept any.
ja: ユーザ名が空でなく要求されたユーザが存在しなければ， サーバは切断してもよい． もしくは 許容できる認証の偽のリスト(どの認証も受け入れられることはない)を送ってもよい．

source: These numbers have been allocated as follows:
ja: この番号は次のように割当てられる:

source: Denial of Service ..................................19 9.3.6.
ja: サービス妨害 ..................................19 9.3.6.

source: End Point Security
ja: エンドポイントのセキュリティ

source: The User-based Security Model [RFC3414] employed symmetric cryptography and user-naming conventions.
ja: User-based Security Model [RFC3414] は, 対称鍵暗号とユーザの命名規則を採用している.

source: Here are two example exchanges between a client and server.
ja: クライアントとサーバの間の交換を2例挙げる.

source: For example, making the host key fingerprint available through a secure DNS lookup, or using Kerberos ([RFC4120]) over GSS-API ([RFC1964]) during key exchange to authenticate the server are possibilities.
ja: たとえば, ホスト鍵の指紋を安全なDNS検索によって利用可能にしたり, サーバを認証して鍵交換する間にGSS-API ([RFC1964])を使ってケルベロス [RFC4120]を利用するといった方法に, 可能性がある.

source: The following message numbers have been defined in this document.
ja: 以下のメッセージ番号を, この文書で定義する.

source: The 'x11 authentication cookie' MUST be hexadecimal encoded.
ja: 'x11 authentication cookie' は 16進にエンコードされなければならない.

source: The null character MUST NOT be sent.
ja: null 文字は送られてはならない.

source: All other SSH key exchange method names beginning with "gss-" and not containing the at-sign ('@'), to be reserved for future key exchange methods defined in conformance with this document, as noted in Section 2.6.
ja: "gss-" で始まり アットマーク('＠')を含まないすべてのSSH鍵交換法名は, 2.6節で注記した, この文書に従って定義された将来の鍵交換法のために予約される.

source: The identity of the SSH client MUST also be verified and authenticated by the SSH server according to local policy to ensure that the incoming SSH client request is legitimate before any configuration or state data is sent to or received from the SSH client.
ja: SSH クライアントの識別情報も, 設定や状態の情報を SSH クライアントに送ったり SSH クライアントから受け取ったりする前に, 受け取った SSH クライアントの要求が正当なものであることを保証するために, ローカルなポリシーに基づいて, SSH サーバにより検証し認証されなければならない.

source: Otherwise, the following algorithm MUST be used to choose a key exchange method: Iterate over client's kex algorithms, one at a time.
ja: さもなければ, それに続くアルゴリズムが鍵交換法として使われなければならない: クライアントの鍵交換アルゴリズムが1つずつ反復される.

source: NETCONF is used to access configuration and state information and to modify configuration information, so the ability to access this protocol should be limited to users and systems that are authorized to view the NETCONF server's configuration and state or to modify the NETCONF server's configuration.
ja: NETCONF は, 設定や状態の情報にアクセスし, 設定情報を変更する. このため, このプロトコルにアクセスする能力は, NETCONF サーバの設定や状態を閲覧したり NETCONF サーバの設定を変更する権限のあるユーザやシステムに制限される必要がある.

source: It defines an OID to identify the SNMP-over-SSH transport domain, a Textual Convention for SSH Addresses, and several statistics counters.
ja: SSH上の SNMP トランスポートドメインを識別する OID, SSHアドレスのテキスト表記, いくつかの統計カウンタを定義する.

source: Introduction ....................................................3 2.
ja: イントロダクション ...............................................3 2.

source: Clients receiving this message MAY log the error details and/or report them to the user.
ja: このメッセージを受け取ったクライアントは エラーの詳細をログに記録したり また/もしくは ユーザに詳細をレポートしたりしてもよい.

source: SSH Subsystem
ja: SSH サブシステム

source: MIB Modules Required for IMPORTS ...................21 7.
ja: IMPORTS に必要な MIB モジュール ...................21 7.

source: The 'service name' specifies the service to start after authentication.
ja: 'service name' は, 認証後に開始するサービスを指定する.

source: The SNMPv3 WG deliberately avoided this and settled for an assertion by the Security Model that the requirements of securityLevel were met.
ja: SNMPv3 WG は, 意図的にこれを避け, セキュリティレベルの要件を満たす セキュリティモデル からの警告で妥協した.

source: Establishing a Session
ja: セッションの確立

source: + if the algorithm requires an encryption-capable host key, there is an encryption-capable algorithm on the server's server_host_key_algorithms that is also supported by the client, and
ja: + そのアルゴリズムが暗号化可能なホスト鍵を必要とするなら, クライアントとサーバ双方の server_host_key_algorithms に挙げられた暗号化可能アルゴリズムである.

source: Abstract
ja: 概要

source: Note that this method is named using the phrase "group1", even though it specifies the use of Oakley Group 2.
ja: この方法は, Oakley Group 2の利用を指定しているのに "group1" を用いて名前付けされていることに注意.

source: Examples include "3des-cbc", "sha-1", "hmac-sha1", and "zlib" (the doublequotes are not part of the name).
ja: たとえば, "3des-cbc", "sha-1", "hmac-sha1", "zlib" だ(ダブルクォーテーション '"' は名前の一部ではない.).

source: The client MAY show the 'description' string to the user.
ja: クライアントは, 'description' 文字列をユーザに表示してもよい.

source: SSH_MSG_USERAUTH_CHANGEREQ - The password was not changed because the new password was not acceptable (e.g., too easy to guess).
ja: SSH_MSG_USERAUTH_CHANGEREQ - 新しいパスワードが受け入れられない(たとえば, 容易に推測可能)のでパスワードが変更されなかった.

source: Architecture
ja: アーキテクチャ

source: SSH implementations that both store the passwords and compare them SHOULD use [SASLPREP] for normalization.
ja: パスワードを保存したり比較するSSHの実装は, 正規化に [SASLPREP] を使う必要がある.

source: It also derives a unique session id that may be used by higher-level protocols.
ja: さらに, より上位のプロトコルで利用される, ユニークなセッションidを導出する.
